# OrthogonalProjectionHeight Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
HomeCamera..::..OrthogonalProjectionHeight Property
HomeCamera Class See Also
---
The height of orthogonal projection view volume.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double OrthogonalProjectionHeight { get; }
```

Visual Basic
---
```text
Public ReadOnly Property OrthogonalProjectionHeight As Double
	Get
```

Visual C++
---
```text
public:
property double OrthogonalProjectionHeight {
	double get ();
}
```

# See Also
HomeCamera Class
Autodesk.Revit.DB Namespace